---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCExtrusionAxes
source: html/ec83b366-85d1-3e3f-edc6-6cffd36848e6.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionAxes

Represents the possible axes to try when generating an extrusion using IFCCreateExtrusionData.

## Syntax (C#)
```csharp
public enum IFCExtrusionAxes
```